# ElementId Constructor (Int32) (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
ElementId Constructor (Int32)
ElementId Class See Also
---
Create an ElementId handle with the given integer id.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public ElementId(
	int id
)
```

Visual Basic
---
```text
Public Sub New ( _
	id As Integer _
)
```

Visual C++
---
```text
public:
ElementId(
	int id
)
```

# ### Parameters
id
    Type: System..::..Int32The id.
# See Also
ElementId Class
ElementId Overload
Autodesk.Revit.DB Namespace